{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 200], "input_dtype": "float32", "sparse": false, "name": "left_input"}, "inbound_nodes": [], "name": "left_input"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 200], "input_dtype": "float32", "sparse": false, "name": "right_input"}, "inbound_nodes": [], "name": "right_input"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": true, "input_dim": 10675, "batch_input_shape": [null, null], "W_regularizer": null, "dropout": 0.0, "output_dim": 50, "input_length": null}, "inbound_nodes": [[["left_input", 0, 0]], [["right_input", 0, 0]]], "name": "embedding_1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 50, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["embedding_1", 0, 0]], [["embedding_1", 1, 0]]], "name": "lstm_1"}, {"class_name": "Reshape", "config": {"target_shape": [1, 50], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["lstm_1", 0, 0]], [["lstm_1", 1, 0]]], "name": "reshape_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [2, 2], "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "cos", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["reshape_1", 0, 0], ["reshape_1", 1, 0]]], "name": "merge_1"}, {"class_name": "Reshape", "config": {"target_shape": [1], "trainable": true, "name": "reshape_2"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "reshape_2"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "main_output"}, "inbound_nodes": [[["reshape_2", 0, 0]]], "name": "main_output"}], "input_layers": [["left_input", 0, 0], ["right_input", 0, 0]], "output_layers": [["main_output", 0, 0]], "name": "model_1"}}